# Tasca M1 T01

In [8]:
%matplotlib inline
# pip install mysql-connector-python
import mysql.connector
from mysql.connector import errorcode

connect to mysql

In [9]:
try:
  mydb = mysql.connector.connect(
    host="localhost",
    user="Toni",
    password="mysql")
except mysql.connector.Error as err:
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  else:
    print(err)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000270DCDC6E50>

create db

In [10]:
mycursor = mydb.cursor()
mycursor.execute("DROP database IF EXISTS movies")
#mycursor.execute("CREATE DATABASE SGAE_Practica")
mycursor.execute("CREATE DATABASE movies")

In [11]:
mydb = mysql.connector.connect(
  host="localhost",
  user="Toni",
  password="mysql",
  database = "movies"
)
mycursor = mydb.cursor()

create tables

In [12]:
mycursor.execute("DROP TABLE IF EXISTS genre")
mycursor.execute(
    "CREATE TABLE genre ("
        " genre_id INT NOT NULL,"
        " genre_name VARCHAR(40) NOT NULL,"
        " created_by_user VARCHAR(40) NOT NULL DEFAULT 'OS_SGAD',"
        " created_date DATE,"
        " updated_date DATE,"
        " CONSTRAINT pk_genre PRIMARY KEY (genre_id)"
    ")"
    )

In [13]:

mycursor.execute("DROP TABLE IF EXISTS movies")
mycursor.execute(
    "CREATE TABLE movies ("
        " movie_id         INTEGER NOT NULL,"
        " movie_title      CHARACTER VARYING(100) NOT NULL,"
        " movie_date       DATE,"
        " movie_format     CHARACTER VARYING(50) ,"
        " movie_genre_id   INTEGER ,"
        " created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,"
        " created_date     DATE ,"
        " updated_date     DATE ,"
        " CONSTRAINT pk_movie PRIMARY KEY (movie_id) ,"
        " CONSTRAINT fk_movie_genre FOREIGN KEY (movie_genre_id) REFERENCES genre (genre_id)"
    ")"
    )

In [14]:
mycursor.execute("DROP TABLE IF EXISTS role")
mycursor.execute(
    "CREATE TABLE role ("
        " role_id          INTEGER NOT NULL ,"
        " role_name        CHARACTER VARYING(60) NOT NULL ,"
        " created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,"
        " created_date     DATE ,"
        " updated_date     DATE ,"
        " CONSTRAINT pk_role PRIMARY KEY (role_id)"
    ")"
    )

In [15]:
mycursor.execute("DROP TABLE IF EXISTS person")
mycursor.execute(
    "CREATE TABLE person ("
         " person_id        INTEGER NOT NULL ,"
         " person_name      CHARACTER VARYING(100) NOT NULL  ,"
         " person_country   CHARACTER VARYING(40) ,"
         " person_dob       DATE NOT NULL  ,"
         " person_dod       DATE  ,"
         " person_parent_id INTEGER  ,"
         " created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,"
         " created_date     DATE ,"
         " updated_date     DATE ,"
         " CONSTRAINT pk_person PRIMARY KEY (person_id) ,"
         " CONSTRAINT fk_person_parent FOREIGN KEY (person_parent_id) REFERENCES person (person_id)"
    ")"
    )

In [16]:
mycursor.execute("DROP TABLE IF EXISTS movie_person")
mycursor.execute(
    "CREATE TABLE movie_person ("
        "  movie_id         INTEGER NOT NULL ,"
        "  person_id        INTEGER NOT NULL ,"
        "  role_id          INTEGER NOT NULL ,"
        "  movie_award_ind  CHAR(1) NOT NULL ,"
        "  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,"
        "  created_date     DATE ,"
        "  updated_date     DATE ,"
        "  CONSTRAINT pk_movper PRIMARY KEY (movie_id, person_id, role_id) ,"
        "  CONSTRAINT fk_movper_movie FOREIGN KEY (movie_id) REFERENCES movies (movie_id) ,"
        "  CONSTRAINT fk_movper_person FOREIGN KEY (person_id) REFERENCES person (person_id) ,"
        "  CONSTRAINT fk_movper_role FOREIGN KEY (role_id) REFERENCES role (role_id)"
    ")"
    )

In [17]:
mycursor.close()

True

insert data

In [18]:
mydb = mysql.connector.connect(
  host="localhost",
  user="Toni",
  password="mysql",
  database = "movies"
)
mycursor = mydb.cursor()

sql= "INSERT INTO genre (genre_id, genre_name, created_by_user) VALUES ( %s, %s, %s)"
val = [
( 1, 'Acción',''),
( 2, 'Ciencia Ficción',''),
( 3, 'Comedia',''),
( 4, 'Drama',''),
( 5, 'Fantasía', 'apermag'),
( 7, 'Musical',''),
( 8, 'Romance',''),
( 9, 'Suspense',''),
(10, 'Terror',''),
(11, 'Bélico','')
]
sql2= "INSERT INTO genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES ( %s, %s, %s, %s, %s)"

val2 = [
( 6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27'),
]
#print (val)

In [19]:
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")
mycursor.executemany(sql2, val2)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

10 was inserted.
1 was inserted.

In [20]:
sql= "INSERT INTO movies (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( %s, %s, %s, %s, %s)"
val = [
( 1, 'Apocalypse Now', '1979-05-10', 'Film', 11),
( 2, 'Star Wars:Episode IV - A New Hope', '1977-05-25', 'Film', 2),
( 3, 'Indiana Jones and the Temple of Doom', '1984-05-08', 'Film', 1),
( 4, 'The Terminal', '2004-06-18', 'Digital', 3),
( 5, 'Jaws', '1975-01-01', 'Film', 10),
( 6, 'ET The Extraterrestrial', '1982-07-25', 'Film', 5),
( 7, 'Psycho', '1960-05-06', 'Film', 9),
( 8, 'Ocho Apellidos Vascos', '2014-03-14', 'Digital', 3),
( 9, 'Ocho Apellidos Catalanes', '2016-06-09', 'Digital', 8),
(10, 'El otro lado de la cama', '2002-09-04', 'Digital', 8),
(11, 'La Gran Familia Española', '2012-10-15', 'Digital', 3),
(12, 'El dia de la bestia', '1994-12-25', 'Film', 1),
(13, 'Braveheart', '1995-08-08', 'Film', 4),
(14, 'The Shawshank Redemption', '1992-01-07', 'Film', 4)
]

In [21]:
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

14 was inserted.

In [22]:
sql= "INSERT INTO role (role_id, role_name) VALUES ( %s, %s)"
val = [
    ( 1, 'Actor'),
    ( 2, 'Director'),    
    ( 3, 'Productor'),
    ( 4, 'Guionista'),
    ( 5, 'Música')
    ]

In [23]:
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

5 was inserted.

In [24]:
sql= "INSERT INTO person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( %s, %s, %s, %s, %s, %s)"
val = [
    ( 1, 'Francis Ford Coppola', 'United States', '1939-04-07', None, None),
    ( 2, 'Carmine Coppola', 'United States', '1945-07-08', None, None),
    ( 3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', None),
    ( 4, 'Robert Duvall', 'United States', '1931-01-05', None, None),
    ( 5, 'Martin Sheen', 'United States', '1940-08-03', None, None),
    ( 6, 'Harrison Ford', 'United States', '1942-07-13', None, None),
    ( 7, 'George Lucas', 'United States', '1944-05-14', None, None),
    ( 8, 'Gary Kurtz', 'United States', '1940-07-27', None, None),
    ( 9, 'Steven Spielberg', 'United States', '1946-12-18', None, None),
    (10, 'John Williams', 'United States', '1928-08-08', None, None),
    (11, 'Tom Hanks', 'United States', '1956-07-09', None, None),
    (12, 'Catherine Zeta-Jones', 'Wales', '1969-09-25', None, None),
    (13, 'Alfred Joseph Hitchcock', 'United Kingdom', '1899-08-13', '1980-04-29', None),
    (14, 'Anthony Perkins', 'United States', '1934-04-04', '1992-09-08', None),
    (15, 'Vera Miles', 'United States', '1929-08-23', None, None),
    (16, 'Emilio Martinez Lazaro', 'Spain', '1956-09-09', None, None),
    (17, 'Dani Rovira', 'Spain', '1984-07-01', None, None),
    (18, 'Clara Lago', 'Spain', '1986-04-17', None, None),
    (19, 'Carmen Machi', 'Spain', '1964-08-09', None, None),
    (20, 'Karra Elejalde', 'Spain', '1960-03-06', None, None),
    (21, 'Daniel Sanchez Arevalo', 'Spain', '1970-06-08', None, None),
    (22, 'Quim Gutierrez', 'Spain', '1981-03-27', None, None),
    (23, 'Robert Alamo', 'Spain', '1970-05-06', None, None),
    (24, 'Hector Colome', 'Spain', '1944-10-25', '2015-02-28', None),
    (25, 'Veronica Echegui', 'Spain', '1983-03-14', None, None),
    (26, 'Patrick Criado', 'Spain', '1995-09-23', None, None),
    (27, 'Sean Connery', 'Scotland', '1930-07-08', None, None),
    (28, 'Mel Gibson', 'Australia', '1950-08-09', None, None),
    (29, 'Morgan Freeman', 'United States', '1935-10-01', None, None),
    (30, 'Tim Robbins', 'United States', '1949-06-07', None, None),
    (41, 'Charlie Sheen', 'United States', '1965-09-03', None, 5),
    (42, 'Emilio Estevez', 'United States', '1962-05-12', None, 5),
    (43, 'Ramón Estevez', 'United States', '1963-08-07', None, 5),
    (44, 'Reneé Estevez', 'United States', '1967-04-02', None, 5),
    (45, 'Paula Speert Sheen', 'United States', '1986-01-06', None,41),
    (46, 'Bob Sheen', 'United States', '2009-05-01', None,41),
    (47, 'Max Sheen', 'United States', '2009-05-01', None,41),
    (48, 'Sam Sheen', 'United States', '2004-03-09', None,41),
    (49, 'Lola Sheen', 'United States', '2005-06-01', None,41),
    (50, 'Paula Jones-Sheen', 'United States', '2003-07-06', None,45),
    (51, 'Paloma Rae Estevez', 'United States', '1986-02-15', None,42),
    (52, 'Taylor Levi Estevez', 'United States', '1984-06-22', None,42)
    ]

In [25]:
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

42 was inserted.

In [26]:
sql= "INSERT INTO movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( %s, %s, %s, %s)"
val = [
    ( 1, 1, 2, 'Y'),
    ( 1, 1, 3, 'N'),
    ( 1, 1, 5, 'N'),
    ( 1, 2, 5, 'N'),
    ( 1, 3, 1, 'N'),
    ( 1, 4, 1, 'N'),
    ( 1, 5, 1, 'Y'),
    ( 1,41, 1, 'N'),
    ( 1, 6, 1, 'N'),
    ( 2, 6, 1, 'N'),
    ( 2, 7, 2, 'Y'),
    ( 2, 8, 3, 'N'),
    ( 3, 6, 1, 'N'),
    ( 3, 7, 4, 'N'),
    ( 3, 9, 2, 'N'),
    ( 3,10, 5, 'N'),
    ( 4, 9, 2, 'N'),
    ( 4, 9, 3, 'N'),
    ( 4,11, 1, 'N'),
    ( 4,12, 1, 'N'),
    ( 5, 9, 2, 'N'),
    ( 6, 9, 2, 'N'),
    ( 7,13, 1, 'N'),
    ( 7,13, 2, 'N'),
    ( 7,13, 3, 'N'),
    ( 7,14, 2, 'N'),
    ( 7,15, 2, 'N'),
    ( 3, 7, 1, 'N'),
    ( 8,16, 2, 'N'),
    ( 9,16, 2, 'N'),
    ( 8,17, 1, 'N'),
    ( 8,18, 1, 'N'),
    ( 8,19, 1, 'N'),
    ( 8,20, 1, 'N'),
    ( 9,17, 1, 'N'),
    ( 9,18, 1, 'N'),
    ( 9,19, 1, 'N'),
    ( 9,20, 1, 'N'),
    (10,16, 2, 'N'),
    (11,21, 2, 'N'),
    (11,21, 4, 'N'),
    (11,22, 1, 'N'),
    (11,23, 1, 'N'),
    (11,24, 1, 'N'),
    (11,25, 1, 'N'),
    (11,26, 1, 'N'),
    (13,28, 1, 'Y'),
    (13,28, 2, 'N'),
    (14,29, 1, 'N'),
    (14,30, 1, 'N')
]

In [27]:
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

50 was inserted.

### Ex2
##### Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom, el país i la data de naixement d'aquelles persones per les quals no consti una data de mort i ordenar les dades de la persona més vella a la persona més jove.

In [28]:
mycursor = mydb.cursor()

sql = "SELECT person_name, person_country, person_dob FROM person WHERE person_dod IS NULL ORDER BY person_dob DESC"
mycursor.execute(sql)
myresult = mycursor.fetchall()

print (myresult)

[('Max Sheen', 'United States', datetime.date(2009, 5, 1)), ('Bob Sheen', 'United States', datetime.date(2009, 5, 1)), ('Lola Sheen', 'United States', datetime.date(2005, 6, 1)), ('Sam Sheen', 'United States', datetime.date(2004, 3, 9)), ('Paula Jones-Sheen', 'United States', datetime.date(2003, 7, 6)), ('Patrick Criado', 'Spain', datetime.date(1995, 9, 23)), ('Clara Lago', 'Spain', datetime.date(1986, 4, 17)), ('Paloma Rae Estevez', 'United States', datetime.date(1986, 2, 15)), ('Paula Speert Sheen', 'United States', datetime.date(1986, 1, 6)), ('Dani Rovira', 'Spain', datetime.date(1984, 7, 1)), ('Taylor Levi Estevez', 'United States', datetime.date(1984, 6, 22)), ('Veronica Echegui', 'Spain', datetime.date(1983, 3, 14)), ('Quim Gutierrez', 'Spain', datetime.date(1981, 3, 27)), ('Daniel Sanchez Arevalo', 'Spain', datetime.date(1970, 6, 8)), ('Robert Alamo', 'Spain', datetime.date(1970, 5, 6)), ('Catherine Zeta-Jones', 'Wales', datetime.date(1969, 9, 25)), ('Reneé Estevez', 'United States', datetime.date(1967, 4, 2)), ('Charlie Sheen', 'United States', datetime.date(1965, 9, 3)), ('Carmen Machi', 'Spain', datetime.date(1964, 8, 9)), ('Ramón Estevez', 'United States', datetime.date(1963, 8, 7)), ('Emilio Estevez', 'United States', datetime.date(1962, 5, 12)), ('Karra Elejalde', 'Spain', datetime.date(1960, 3, 6)), ('Emilio Martinez Lazaro', 'Spain', datetime.date(1956, 9, 9)), ('Tom Hanks', 'United States', datetime.date(1956, 7, 9)), ('Mel Gibson', 'Australia', datetime.date(1950, 8, 9)), ('Tim Robbins', 'United States', datetime.date(1949, 6, 7)), ('Steven Spielberg', 'United States', datetime.date(1946, 12, 18)), ('Carmine Coppola', 'United States', datetime.date(1945, 7, 8)), ('George Lucas', 'United States', datetime.date(1944, 5, 14)), ('Harrison Ford', 'United States', datetime.date(1942, 7, 13)), ('Martin Sheen', 'United States', datetime.date(1940, 8, 3)), ('Gary Kurtz', 'United States', datetime.date(1940, 7, 27)), ('Francis Ford Coppola', 'United States', datetime.date(1939, 4, 7)), ('Morgan Freeman', 'United States', datetime.date(1935, 10, 1)), ('Robert Duvall', 'United States', datetime.date(1931, 1, 5)), ('Sean Connery', 'Scotland', datetime.date(1930, 7, 8)), ('Vera Miles', 'United States', datetime.date(1929, 8, 23)), ('John Williams', 'United States', datetime.date(1928, 8, 8))]

### Ex3  
##### Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom del gènere i el nombre total de pel·lícules d'aquest gènere i ordenar-ho per ordre descendent de nombre total de pel·lícules.

In [29]:
mycursor = mydb.cursor()

sql = "SELECT \
  g.genre_name AS genre, \
  count(m.movie_id) AS total\
  FROM genre g \
  INNER JOIN movies m ON m.movie_genre_id = g.genre_id\
  GROUP BY g.genre_name\
  ORDER BY total DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()
print (myresult)

[('Comedia', 3), ('Acción', 2), ('Drama', 2), ('Romance', 2), ('Ciencia Ficción', 1), ('Fantasía', 1), ('Suspense', 1), ('Terror', 1), ('Bélico', 1)]

### Ex4  
##### Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir, per a cada persona, el seu nom i el nombre màxim de rols diferents que ha tingut en una mateixa pel·lícula.

In [30]:
mycursor = mydb.cursor()

sql = "SELECT \
  p.person_name, \
  count(r.role_id) AS Roles\
  FROM person p \
  INNER JOIN movie_person m ON m.person_id = p.person_id\
  INNER JOIN role r ON r.role_id = m.role_id\
  GROUP BY p.person_name\
  ORDER BY Roles DESC \
  "

mycursor.execute(sql)

myresult = mycursor.fetchall()
print (myresult)

[('Steven Spielberg', 5), ('Harrison Ford', 3), ('George Lucas', 3), ('Alfred Joseph Hitchcock', 3), ('Francis Ford Coppola', 3), ('Emilio Martinez Lazaro', 3), ('Dani Rovira', 2), ('Clara Lago', 2), ('Carmen Machi', 2), ('Karra Elejalde', 2), ('Mel Gibson', 2), ('Daniel Sanchez Arevalo', 2), ('Marlon Brando', 1), ('Robert Duvall', 1), ('Martin Sheen', 1), ('Charlie Sheen', 1), ('Tom Hanks', 1), ('Catherine Zeta-Jones', 1), ('Quim Gutierrez', 1), ('Robert Alamo', 1), ('Hector Colome', 1), ('Veronica Echegui', 1), ('Patrick Criado', 1), ('Morgan Freeman', 1), ('Tim Robbins', 1), ('Anthony Perkins', 1), ('Vera Miles', 1), ('Gary Kurtz', 1), ('Carmine Coppola', 1), ('John Williams', 1)]

### Ex5  
##### Realitza la següent operació sobre la base de dades acabada de crear: 

Has de crear un nou gènere anomenat "Documental" el qual tingui com a identificador el nombre 69.

In [31]:
mycursor = mydb.cursor()
sql= "INSERT INTO genre (genre_id, genre_name, created_by_user) VALUES ( 69, 'Documental','')"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [32]:
mycursor.execute("SELECT * FROM genre")
myresult = mycursor.fetchall()

print (myresult)

[(1, 'Acción', '', None, None), (2, 'Ciencia Ficción', '', None, None), (3, 'Comedia', '', None, None), (4, 'Drama', '', None, None), (5, 'Fantasía', 'apermag', None, None), (6, 'Melodrama', 'apermag', datetime.date(2018, 9, 1), datetime.date(2018, 9, 27)), (7, 'Musical', '', None, None), (8, 'Romance', '', None, None), (9, 'Suspense', '', None, None), (10, 'Terror', '', None, None), (11, 'Bélico', '', None, None), (69, 'Documental', '', None, None)]

### Ex6  
##### Fes la següent operació sobre la base de dades acabada de crear:  

Elimina la pel·lícula "La Gran Familia Española" de la base de dades.

In [33]:
mycursor = mydb.cursor()

sql= "DELETE FROM movies WHERE movie_title = %s"
adr= ('La Gran Familia Española',)
mycursor.execute(sql, adr)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

IntegrityError: 1451 (23000): Cannot delete or update a parent row: a foreign key constraint fails (`movies`.`movie_person`, CONSTRAINT `fk_movper_movie` FOREIGN KEY (`movie_id`) REFERENCES `movies` (`movie_id`))

### Ex7  
##### Realitza la següent operació sobre la base de dades acabada de crear: 

Canvia el gènere de la pel·lícula "Ocho apellidos catalanes" perquè consti com a comèdia i no com a romàntica.

In [34]:
mycursor = mydb.cursor()

sql = "UPDATE movies SET movie_genre_id = %s WHERE movie_title = %s"
val = ("3", "Ocho Apellidos Catalanes")

mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

In [35]:
mycursor.execute("SELECT * FROM movies")
myresult = mycursor.fetchall()

print (myresult)

[(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None), (2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None), (3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None), (4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None), (5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None), (6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None), (7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None), (8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None), (9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 3, 'OS_SGAD', None, None), (10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None), (11, 'La Gran Familia Española', datetime.date(2012, 10, 15), 'Digital', 3, 'OS_SGAD', None, None), (12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None), (13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None), (14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)]

In [36]:
mycursor.close()

True